Repository: mhmetglrq/text_repeater
Catalog: lib/config/l10n/lang_*.arb
Languages: ar, hi, id, pt, tr

# iLoveYouText
source: i love you 💙😍💕
ar: أحبك 💙😍💕
hi: मुझे तुमसे प्यार है 💙😍💕
id: Aku cinta kamu 💙😍💕
pt: Eu te amo 💙😍💕
tr: Seni seviyorum 💙😍💕

# welcomeOnboard
source: Welcome to Text Repeater
ar: مرحبًا بك في مكرر النصوص
hi: पाठ पुनरावृत्ति में आपका स्वागत है
id: Selamat Datang di Pengulang Teks
pt: Bem-vindo ao Repetidor de Texto
tr: Metin Tekrarlayıcı'ya Hoş Geldiniz

# enterDashboard
source: This app will help you to repeat your text as many times as you want.
ar: سيساعدك هذا التطبيق على تكرار نصك عدة مرات حسب الرغبة.
hi: यह ऐप आपको अपने पाठ को कई बार दोहराने में मदद करेगा।
id: Aplikasi ini akan membantu Anda mengulang teks sebanyak yang Anda inginkan.
pt: Este aplicativo ajudará você a repetir seu texto quantas vezes desejar.
tr: Bu uygulama, metninizi istediğiniz kadar tekrar etmenize yardımcı olacak.

source: Get Started
ar: ابدأ
hi: शुरू करें
id: Mulai
pt: Começar
tr: Başla

source: Welcome to
ar: مرحبًا بك في
hi: में आपका स्वागत है
id: Selamat Datang di
pt: Bem-vindo ao
tr: Hoş Geldiniz

# textRepeaterHome
source: Text Repeater 🙌
ar: مكرر النصوص 🙌
hi: पाठ पुनरावृत्ति 🙌
id: Pengulang Teks 🙌
pt: Repetidor de Texto 🙌
tr: Metin Tekrarlayıcı 🙌

source: Recent Texts
ar: النصوص الحديثة
hi: हाल के पाठ
id: Teks Terbaru
pt: Textos Recentes
tr: Son Metinler

# repeatTextMenuTitle
source: Text Repeater
ar: مكرر النصوص
hi: पाठ पुनरावृत्ति
id: Pengulang Teks
pt: Repetidor de Texto
tr: Metin Tekrarlayıcı

# repeatTextMenuDesc
source: Repeat any text multiple times
ar: كرر أي نص عدة مرات
hi: किसी भी पाठ को कई बार दोहराएं
id: Ulangi teks apapun berkali-kali
pt: Repita qualquer texto várias vezes
tr: Herhangi bir metni birçok kez tekrar et

# randomTextMenuTitle
source: Text Randomizer
ar: عشوائي النص
hi: पाठ यादृच्छिककार
id: Pengacak Teks
pt: Randomizador de Texto
tr: Metin Karıştırıcı

# randomTextMenuDesc
source: Randomize words or characters in your text
ar: عشوائية الكلمات أو الأحرف في النص
hi: अपने पाठ में शब्दों या पात्रों को यादृच्छिक करें
id: Acak kata atau karakter dalam teks Anda
pt: Aleatorize palavras ou caracteres no seu texto
tr: Metninizdeki kelime veya karakterleri karıştır

# wordCloudMenuTitle
source: Word Cloud
ar: سحابة الكلمات
hi: शब्द क्लाउड
id: Awan Kata
pt: Nuvem de Palavras
tr: Kelime Bulutu

# wordCloudMenuDesc
source: Create a word cloud from your text
ar: أنشئ سحابة كلمات من نصك
hi: अपने पाठ से एक शब्द क्लाउड बनाएं
id: Buat awan kata dari teks Anda
pt: Crie uma nuvem de palavras a partir do seu texto
tr: Metninizden bir kelime bulutu oluştur

# sortTextMenuTitle
source: Text Sorter
ar: فرز النص
hi: पाठ क्रमबद्धक
id: Pengurut Teks
pt: Organizador de Texto
tr: Metin Sıralayıcı

# sortTextMenuDesc
source: Sort your text alphabetically or by length
ar: فرز النص أبجديًا أو حسب الطول
hi: अपने पाठ को वर्णानुक्रम में या लंबाई के अनुसार क्रमबद्ध करें
id: Urutkan teks Anda secara alfabet atau berdasarkan panjang
pt: Organize seu texto alfabeticamente ou por comprimento
tr: Metninizi alfabetik veya uzunluğa göre sırala

# reverseTextMenuTitle
source: Text Reverser
ar: عكس النص
hi: पाठ उल्टा
id: Pembalik Teks
pt: Inversor de Texto
tr: Metin Ters Çevirici

# reverseTextMenuDesc
source: Reverse your text
ar: اعكس النص
hi: अपने पाठ को उल्टा करें
id: Balik teks Anda
pt: Inverta seu texto
tr: Metninizi ters çevir

source: Text
ar: نص
hi: पाठ
id: Teks
pt: Texto
tr: Metin

source: Repeat Count
ar: عدد التكرار
hi: दोहराने की संख्या
id: Jumlah Pengulangan
pt: Contagem de Repetições
tr: Tekrar Sayısı

source: New Line
ar: سطر جديد
hi: नई पंक्ति
id: Baris Baru
pt: Nova Linha
tr: Yeni Satır

source: Repeat
ar: كرر
hi: दोहराएं
id: Ulangi
pt: Repetir
tr: Tekrarla

source: Randomize
ar: عشوائي
hi: यादृच्छिक करें
id: Acak
pt: Aleatorizar
tr: Karıştır

source: Create Word Cloud
ar: أنشئ سحابة الكلمات
hi: शब्द क्लाउड बनाएँ
id: Buat Awan Kata
pt: Criar Nuvem de Palavras
tr: Kelime Bulutu Oluştur

source: Sort
ar: فرز
hi: क्रमबद्ध करें
id: Urutkan
pt: Organizar
tr: Sırala

source: Reverse
ar: عكس
hi: उल्टा
id: Balik
pt: Inverter
tr: Ters Çevir

source: Copy
ar: نسخ
hi: प्रतिलिपि बनाएँ
id: Salin
pt: Copiar
tr: Kopyala

# copiedTitle
source: Copied to clipboard!
ar: تم النسخ إلى الحافظة!
hi: क्लिपबोर्ड पर प्रतिलिपित किया गया!
id: Disalin ke papan klip!
pt: Copiado para a área de transferência!
tr: Panoya kopyalandı!

# copiedMsg
source: The text has been copied to the clipboard.
ar: تم نسخ النص إلى الحافظة.
hi: पाठ को क्लिपबोर्ड में प्रतिलिपित किया गया है।
id: Teks telah disalin ke papan klip.
pt: O texto foi copiado para a área de transferência.
tr: Metin panoya kopyalandı.

source: Share
ar: شارك
hi: साझा करें
id: Bagikan
pt: Compartilhar
tr: Paylaş

# textValid
source: Please enter some text
ar: الرجاء إدخال نص
hi: कृपया कोई पाठ दर्ज करें
id: Silakan masukkan teks
pt: Por favor, insira algum texto
tr: Lütfen bir metin girin

# countValid
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
hi: कृपया एक वैध संख्या दर्ज करें
id: Silakan masukkan angka yang valid
pt: Por favor, insira um número válido
tr: Lütfen geçerli bir sayı girin

# wordCloudValid
source: Please enter more than one word
ar: الرجاء إدخال أكثر من كلمة واحدة
hi: कृपया एक से अधिक शब्द दर्ज करें
id: Silakan masukkan lebih dari satu kata
pt: Por favor, insira mais de uma palavra
tr: Lütfen birden fazla kelime girin

# greatThanZero
source: Please enter a number greater than 0
ar: الرجاء إدخال رقم أكبر من 0
hi: कृपया 0 से अधिक एक संख्या दर्ज करें
id: Silakan masukkan angka lebih besar dari 0
pt: Por favor, insira um número maior que 0
tr: Lütfen 0'dan büyük bir sayı girin

# validNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
hi: कृपया एक वैध संख्या दर्ज करें
id: Silakan masukkan angka yang valid
pt: Por favor, insira um número válido
tr: Lütfen geçerli bir sayı girin

# lessThanTenThousand
source: Please enter a number less than 10000
ar: الرجاء إدخال رقم أقل من 10000
hi: कृपया 10000 से कम एक संख्या दर्ज करें
id: Silakan masukkan angka kurang dari 10000
pt: Por favor, insira um número menor que 10000
tr: Lütfen 10000'den küçük bir sayı girin

# errorTitle
source: Error
ar: خطأ
hi: त्रुटि
id: Kesalahan
pt: Erro
tr: Hata

# shareText
source: Check out this Word Cloud!
ar: تحقق من سحابة الكلمات هذه!
hi: इस शब्द क्लाउड की जाँच करें!
id: Lihatlah Awan Kata ini!
pt: Confira esta Nuvem de Palavras!
tr: Bu Kelime Bulutuna göz atın!

# shareImgErrorDesc
source: Failed to share image.
ar: فشل في مشاركة الصورة.
hi: छवि साझा करने में विफल हुआ।
id: Gagal membagikan gambar.
pt: Falha ao compartilhar a imagem.
tr: Resmi paylaşma başarısız oldu.
